데이터 시각화 3주차 1~5

W3 1-2. Summarize Data_판다스로 기본 통계하기

In [2]:
# 모듈 불러오기
import pandas as pd
import seaborn as sns # iris 사용
import numpy as np

In [3]:
df = sns.load_dataset('iris') 
df.shape

(150, 5)

In [4]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

### value_counts()
- 시리즈 객체의 고유값(unique value) 개수를 세는데 사용
- 언더바 주의

In [5]:
df['species'].value_counts() # 범주형 데이터

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [6]:
df['petal_width'].value_counts() #숫자형 데이터

0.2    29
1.3    13
1.5    12
1.8    12
1.4     8
2.3     8
1.0     7
0.4     7
0.3     7
2.1     6
2.0     6
1.2     5
1.9     5
0.1     5
1.6     4
2.5     3
2.2     3
1.1     3
2.4     3
1.7     2
0.5     1
0.6     1
Name: petal_width, dtype: int64

In [7]:
pd.DataFrame(df['petal_width'].value_counts()) #숫자형 데이터

     petal_width
0.2           29
1.3           13
1.5           12
1.8           12
1.4            8
2.3            8
1.0            7
0.4            7
0.3            7
2.1            6
2.0            6
1.2            5
1.9            5
0.1            5
1.6            4
2.5            3
2.2            3
1.1            3
2.4            3
1.7            2
0.5            1
0.6            1

### len()
데이터프레임 행의 갯수

In [8]:
len(df)

150

In [9]:
df.shape[0] # 행만 가지고 오고 싶을 때 axis=0은 행이였던 걸로 암기

150

In [10]:
df.shape[1] # 열만 가지고 오고 싶을 때

5

In [11]:
len(df) == df.shape[0]

True

### nunique()
명확한 유일 값의 개수 확인

In [12]:
df['species'].nunique() #unique 한 개수가 3개임을 확인

3

In [13]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [14]:
df.describe(include=[np.object]) #  object type 만 보여짐

C:\ProgramData\Anaconda3\envs\py3_7_6\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  """Entry point for launching an IPython kernel.

       species
count      150
unique       3
top     setosa
freq        50

In [15]:
df.describe(exclude=[np.object])

C:\ProgramData\Anaconda3\envs\py3_7_6\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  """Entry point for launching an IPython kernel.

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [16]:
df.describe(include=[np.number]) # 숫자형 타입만 보여짐

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [17]:
df['petal_width'].sum() # 합계

179.90000000000003

In [18]:
df['petal_width'].count() # 개수

150

In [20]:
df['petal_width'].median() #특정 컬럼(column)의 중앙값

1.3

In [21]:
df.median() # df 전체의 중위수

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [22]:
df['petal_width'].mean() # 평균값

1.1993333333333336

In [23]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [24]:
pd.DataFrame(df.mean())

                     0
sepal_length  5.843333
sepal_width   3.057333
petal_length  3.758000
petal_width   1.199333

In [25]:
df['petal_width'].quantile([0.25,0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

#### quantile: 
- 백분위수는 오름차순 정렬했을 때 0을 최소값, 100을 최대값으로 백분율로 나타낸 특정 위치 값이다. 사분위수는 25, 50, 75를 기준 점으로 나눠져 1분위부터 4분위까지 존재하게 됩니다.
- pandas의 quantile함수의 q(백분위수)는 0과 1사이 값을 입력함.

In [26]:
df.min() # 최소값

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [27]:
df.max() # 최대값

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [28]:
df.var() # 분산

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [29]:
df.std() # 표준편차

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [30]:
df.corr() # 상관관계

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

## 2. apply()
- 데이터 전처리하는데 유용하다. apply는 lambda를 사용하기 위해 주로 사용
- df.apply() 함수는 행을 따라(axis=0이 기본값) 모든 요소에 입력 함수를 적용합니다. 또는 호출자 Pandas DataFrame의 열(열 기준이면 axis=1 옵션 넣어야 함)

In [31]:
df.apply?

### lambda : 
사용자 직접 만든 함수

In [32]:
df.apply(lambda x : x[0]) # loc[]인가...

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [33]:
df.apply(lambda x : x[1])

sepal_length       4.9
sepal_width        3.0
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [34]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [36]:
df.loc[0]

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
Name: 0, dtype: object

In [37]:
df.loc[0] == df.apply(lambda x : x[0])

sepal_length    True
sepal_width     True
petal_length    True
petal_width     True
species         True
dtype: bool

In [38]:
df['species'].apply(lambda x : x[0]) # species 에서 1번째 글자만 가지고 옴

0      s
1      s
2      s
3      s
4      s
      ..
145    v
146    v
147    v
148    v
149    v
Name: species, Length: 150, dtype: object

In [39]:
df['species'].apply(lambda x : x[:3]) # species 에서 1~3번째 글자만 가지고 옴

0      set
1      set
2      set
3      set
4      set
      ...
145    vir
146    vir
147    vir
148    vir
149    vir
Name: species, Length: 150, dtype: object

In [42]:
df['species_3'] == df['species'].apply(lambda x : x[:3])

0      True
1      True
2      True
3      True
4      True
       ...
145    True
146    True
147    True
148    True
149    True
Length: 150, dtype: bool

In [43]:
df

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       set
1             4.9          3.0           1.4          0.2     setosa       set
2             4.7          3.2           1.3          0.2     setosa       set
3             4.6          3.1           1.5          0.2     setosa       set
4             5.0          3.6           1.4          0.2     setosa       set
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       vir
146           6.3          2.5           5.0          1.9  virginica       vir
147           6.5          3.0           5.2          2.0  virginica       vir
148           6.2          3.4           5.4          2.3  virginica       vir
149           5.9          3.0           5.1          1.8  virginica       vir

[150 rows x 6 columns]

In [44]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species species_3
0           5.1          3.5           1.4          0.2  setosa       set
1           4.9          3.0           1.4          0.2  setosa       set
2           4.7          3.2           1.3          0.2  setosa       set
3           4.6          3.1           1.5          0.2  setosa       set
4           5.0          3.6           1.4          0.2  setosa       set

In [45]:
def smp(x):
    # 뒤에서 3번째까지의 문자를 가져오는 함수를 만듬
    x = x[-3:]
    return x

In [46]:
df['species_3'] == df['species'].apply(lambda x : x[:3])

0      True
1      True
2      True
3      True
4      True
       ...
145    True
146    True
147    True
148    True
149    True
Length: 150, dtype: bool

In [52]:
df['species_3'] == df['species'].apply(smp)

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Length: 150, dtype: bool

In [53]:
df

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       set
1             4.9          3.0           1.4          0.2     setosa       set
2             4.7          3.2           1.3          0.2     setosa       set
3             4.6          3.1           1.5          0.2     setosa       set
4             5.0          3.6           1.4          0.2     setosa       set
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       vir
146           6.3          2.5           5.0          1.9  virginica       vir
147           6.5          3.0           5.2          2.0  virginica       vir
148           6.2          3.4           5.4          2.3  virginica       vir
149           5.9          3.0           5.1          1.8  virginica       vir

[150 rows x 6 columns]

# 3. Handling_Missing_Data
### dropna()
NaN값 제거

In [54]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5]],
                  columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [55]:
df.dropna(axis=0, how='all') # axis =0: 행, axis= 1: 열, how='all': 전부 다  null 값이 있으면 drop 시킴

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [56]:
df.dropna(axis=1, how='all') # axis =0: 행, axis= 1: 열, how='all': 전부 다  null 값이 있으면 drop 시킴

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [57]:
df.dropna(axis=0, how='any')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [58]:
df.dropna(axis=1, how='any')

   D
0  0
1  1
2  5

### fillna()
~으로 채우기

In [59]:
df.fillna(0) # null 값을 0 으로 채움

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [60]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3} 
df.fillna(value=values)

#  NULL값을 A는 0, B는 1, C는 2, D는 3의 값으로 채움 
# D는 이미 값이 저장되어 있기에 바뀌지 않음

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [62]:
df # 업데이트/ 대체되지 않았음

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

### NaN 값을 평균값으로 채우기

In [63]:
df['A'].mean()

3.0

In [64]:
df['D'].mean()

2.0

In [65]:
df.fillna(df['D'].mean())

     A    B    C  D
0  2.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  2.0  2.0  2.0  5

In [68]:
df['D'].median() # 중앙값. 중위수

1.0

In [69]:
df.fillna(df['D'].median())

     A    B    C  D
0  1.0  2.0  1.0  0
1  3.0  4.0  1.0  1
2  1.0  1.0  1.0  5

In [70]:
fill_na_value = df['D'].max()
fill_na_value

5

In [71]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [72]:
df.fillna(fill_na_value)

     A    B    C  D
0  5.0  2.0  5.0  0
1  3.0  4.0  5.0  1
2  5.0  5.0  5.0  5

In [74]:
df.isnull() # null이 있는가에 대한 답으로 T/F boolean 으로 나옴

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [75]:
df.isnull().sum() # 결측치가 몇 개인지 확인

A    2
B    1
C    3
D    0
dtype: int64

In [76]:
df.notnull().sum()

A    1
B    2
C    0
D    3
dtype: int64

# 4. assign으로 새로운 컬럼 만들기

In [77]:
df = pd.DataFrame({'A': range(1, 11), 'B': np.random.randn(10)})
df # 새 칼럼 만들기 1

    A         B
0   1 -1.336180
1   2  1.209121
2   3  1.565805
3   4  1.253236
4   5 -0.194405
5   6 -0.088759
6   7  0.708732
7   8  0.160845
8   9 -0.531454
9  10 -0.327728

In [82]:
df.assign(ln_A = lambda x: np.log(x.A)) # 새 칼럼 만들기 2

    A         B      ln_A
0   1 -1.336180  0.000000
1   2  1.209121  0.693147
2   3  1.565805  1.098612
3   4  1.253236  1.386294
4   5 -0.194405  1.609438
5   6 -0.088759  1.791759
6   7  0.708732  1.945910
7   8  0.160845  2.079442
8   9 -0.531454  2.197225
9  10 -0.327728  2.302585

In [83]:
df.assign(ln_A = lambda x: np.log(x.A)).head()

   A         B      ln_A
0  1 -1.336180  0.000000
1  2  1.209121  0.693147
2  3  1.565805  1.098612
3  4  1.253236  1.386294
4  5 -0.194405  1.609438

In [85]:
df["ln_A"] = np.log(df.A)
df["ln_A"]

0    0.000000
1    0.693147
2    1.098612
3    1.386294
4    1.609438
5    1.791759
6    1.945910
7    2.079442
8    2.197225
9    2.302585
Name: ln_A, dtype: float64

In [86]:
df

    A         B      ln_A
0   1 -1.336180  0.000000
1   2  1.209121  0.693147
2   3  1.565805  1.098612
3   4  1.253236  1.386294
4   5 -0.194405  1.609438
5   6 -0.088759  1.791759
6   7  0.708732  1.945910
7   8  0.160845  2.079442
8   9 -0.531454  2.197225
9  10 -0.327728  2.302585

In [87]:
df.ln_A = np.log(df.A)
df

    A         B      ln_A
0   1 -1.336180  0.000000
1   2  1.209121  0.693147
2   3  1.565805  1.098612
3   4  1.253236  1.386294
4   5 -0.194405  1.609438
5   6 -0.088759  1.791759
6   7  0.708732  1.945910
7   8  0.160845  2.079442
8   9 -0.531454  2.197225
9  10 -0.327728  2.302585

# 5. qcut()으로 binning, bucketing 하기
특정한 값을 분위수에 기반하여 카테고리별로 분류하는데 편리합니다. => 비닝, 버케닝

In [88]:
pd.qcut(df.A, 3, labels=["good", "median","bad"])

0      good
1      good
2      good
3      good
4    median
5    median
6    median
7       bad
8       bad
9       bad
Name: A, dtype: category
Categories (3, object): ['good' < 'median' < 'bad']

In [89]:
pd.qcut(df.B, 2, labels=["good", "bad"])

0    good
1     bad
2     bad
3     bad
4    good
5    good
6     bad
7     bad
8    good
9    good
Name: B, dtype: category
Categories (2, object): ['good' < 'bad']

In [91]:
df

    A         B      ln_A
0   1 -1.336180  0.000000
1   2  1.209121  0.693147
2   3  1.565805  1.098612
3   4  1.253236  1.386294
4   5 -0.194405  1.609438
5   6 -0.088759  1.791759
6   7  0.708732  1.945910
7   8  0.160845  2.079442
8   9 -0.531454  2.197225
9  10 -0.327728  2.302585

#### axis=0 행에서의 최대/최소값

In [92]:
df.max(axis=0) # 행에서의 최대값 가져오기

A       10.000000
B        1.565805
ln_A     2.302585
dtype: float64

In [93]:
df.min(axis=0) # 행에서의 최소값 가져오기

A       1.00000
B      -1.33618
ln_A    0.00000
dtype: float64

### clip()
특정 구간으로 값들을 한정해야 할 때 주로 사용

In [94]:
df['A'].clip(lower = -10, upper= 10)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: A, dtype: int64

In [95]:
df["B"].clip(lower=1,upper=3)

0    1.000000
1    1.209121
2    1.565805
3    1.253236
4    1.000000
5    1.000000
6    1.000000
7    1.000000
8    1.000000
9    1.000000
Name: B, dtype: float64

### abs()
절대값

In [97]:
df["B"]

0   -1.336180
1    1.209121
2    1.565805
3    1.253236
4   -0.194405
5   -0.088759
6    0.708732
7    0.160845
8   -0.531454
9   -0.327728
Name: B, dtype: float64

In [98]:
df["B"].abs()

0    1.336180
1    1.209121
2    1.565805
3    1.253236
4    0.194405
5    0.088759
6    0.708732
7    0.160845
8    0.531454
9    0.327728
Name: B, dtype: float64

--- seYi